###################################################################

# Created by write_sdc on Fri May 19 03:22:40 2023

###################################################################
set sdc_version 2.1

set_units -time ns -resistance kOhm -capacitance pF -voltage V -current mA
set_operating_conditions -max WCCOM -max_library                               \
fsa0m_a_generic_core_ss1p62v125c\
                         -min BCCOM -min_library                               \
fsa0m_a_generic_core_ff1p98vm40c
set_wire_load_model -name G200K -library fsa0m_a_generic_core_tt1p8v25c
set_max_fanout 10 [current_design]
set_max_area 0
set_load -pin_load 10 [get_ports o_valid]
set_load -pin_load 10 [get_ports {o_quotient[31]}]
set_load -pin_load 10 [get_ports {o_quotient[30]}]
set_load -pin_load 10 [get_ports {o_quotient[29]}]
set_load -pin_load 10 [get_ports {o_quotient[28]}]
set_load -pin_load 10 [get_ports {o_quotient[27]}]
set_load -pin_load 10 [get_ports {o_quotient[26]}]
set_load -pin_load 10 [get_ports {o_quotient[25]}]
set_load -pin_load 10 [get_ports {o_quotient[24]}]
set_load -pin_load 10 [get_ports {o_quotient[23]}]
set_load -pin_load 10 [get_ports {o_quotient[22]}]
set_load -pin_load 10 [get_ports {o_quotient[21]}]
set_load -pin_load 10 [get_ports {o_quotient[20]}]
set_load -pin_load 10 [get_ports {o_quotient[19]}]
set_load -pin_load 10 [get_ports {o_quotient[18]}]
set_load -pin_load 10 [get_ports {o_quotient[17]}]
set_load -pin_load 10 [get_ports {o_quotient[16]}]
set_load -pin_load 10 [get_ports {o_quotient[15]}]
set_load -pin_load 10 [get_ports {o_quotient[14]}]
set_load -pin_load 10 [get_ports {o_quotient[13]}]
set_load -pin_load 10 [get_ports {o_quotient[12]}]
set_load -pin_load 10 [get_ports {o_quotient[11]}]
set_load -pin_load 10 [get_ports {o_quotient[10]}]
set_load -pin_load 10 [get_ports {o_quotient[9]}]
set_load -pin_load 10 [get_ports {o_quotient[8]}]
set_load -pin_load 10 [get_ports {o_quotient[7]}]
set_load -pin_load 10 [get_ports {o_quotient[6]}]
set_load -pin_load 10 [get_ports {o_quotient[5]}]
set_load -pin_load 10 [get_ports {o_quotient[4]}]
set_load -pin_load 10 [get_ports {o_quotient[3]}]
set_load -pin_load 10 [get_ports {o_quotient[2]}]
set_load -pin_load 10 [get_ports {o_quotient[1]}]
set_load -pin_load 10 [get_ports {o_quotient[0]}]
create_clock [get_ports i_clk]  -period 10  -waveform {0 5}
set_clock_latency 0.5  [get_clocks i_clk]
set_clock_uncertainty 0.1  [get_clocks i_clk]
set_input_delay -clock i_clk  -max 1  [get_ports i_clk]
set_input_delay -clock i_clk  -max 1  [get_ports i_reset]
set_input_delay -clock i_clk  -max 1  [get_ports i_valid]
set_input_delay -clock i_clk  -max 1  [get_ports {i_divisor[7]}]
set_input_delay -clock i_clk  -max 1  [get_ports {i_divisor[6]}]
set_input_delay -clock i_clk  -max 1  [get_ports {i_divisor[5]}]
set_input_delay -clock i_clk  -max 1  [get_ports {i_divisor[4]}]
set_input_delay -clock i_clk  -max 1  [get_ports {i_divisor[3]}]
set_input_delay -clock i_clk  -max 1  [get_ports {i_divisor[2]}]
set_input_delay -clock i_clk  -max 1  [get_ports {i_divisor[1]}]
set_input_delay -clock i_clk  -max 1  [get_ports {i_divisor[0]}]
set_output_delay -clock i_clk  -min 0.5  [get_ports o_valid]
set_output_delay -clock i_clk  -min 0.5  [get_ports {o_quotient[31]}]
set_output_delay -clock i_clk  -min 0.5  [get_ports {o_quotient[30]}]
set_output_delay -clock i_clk  -min 0.5  [get_ports {o_quotient[29]}]
set_output_delay -clock i_clk  -min 0.5  [get_ports {o_quotient[28]}]
set_output_delay -clock i_clk  -min 0.5  [get_ports {o_quotient[27]}]
set_output_delay -clock i_clk  -min 0.5  [get_ports {o_quotient[26]}]
set_output_delay -clock i_clk  -min 0.5  [get_ports {o_quotient[25]}]
set_output_delay -clock i_clk  -min 0.5  [get_ports {o_quotient[24]}]
set_output_delay -clock i_clk  -min 0.5  [get_ports {o_quotient[23]}]
set_output_delay -clock i_clk  -min 0.5  [get_ports {o_quotient[22]}]
set_output_delay -clock i_clk  -min 0.5  [get_ports {o_quotient[21]}]
set_output_delay -clock i_clk  -min 0.5  [get_ports {o_quotient[20]}]
set_output_delay -clock i_clk  -min 0.5  [get_ports {o_quotient[19]}]
set_output_delay -clock i_clk  -min 0.5  [get_ports {o_quotient[18]}]
set_output_delay -clock i_clk  -min 0.5  [get_ports {o_quotient[17]}]
set_output_delay -clock i_clk  -min 0.5  [get_ports {o_quotient[16]}]
set_output_delay -clock i_clk  -min 0.5  [get_ports {o_quotient[15]}]
set_output_delay -clock i_clk  -min 0.5  [get_ports {o_quotient[14]}]
set_output_delay -clock i_clk  -min 0.5  [get_ports {o_quotient[13]}]
set_output_delay -clock i_clk  -min 0.5  [get_ports {o_quotient[12]}]
set_output_delay -clock i_clk  -min 0.5  [get_ports {o_quotient[11]}]
set_output_delay -clock i_clk  -min 0.5  [get_ports {o_quotient[10]}]
set_output_delay -clock i_clk  -min 0.5  [get_ports {o_quotient[9]}]
set_output_delay -clock i_clk  -min 0.5  [get_ports {o_quotient[8]}]
set_output_delay -clock i_clk  -min 0.5  [get_ports {o_quotient[7]}]
set_output_delay -clock i_clk  -min 0.5  [get_ports {o_quotient[6]}]
set_output_delay -clock i_clk  -min 0.5  [get_ports {o_quotient[5]}]
set_output_delay -clock i_clk  -min 0.5  [get_ports {o_quotient[4]}]
set_output_delay -clock i_clk  -min 0.5  [get_ports {o_quotient[3]}]
set_output_delay -clock i_clk  -min 0.5  [get_ports {o_quotient[2]}]
set_output_delay -clock i_clk  -min 0.5  [get_ports {o_quotient[1]}]
set_output_delay -clock i_clk  -min 0.5  [get_ports {o_quotient[0]}]
set_drive 1  [get_ports i_clk]
set_drive 1  [get_ports i_reset]
set_drive 1  [get_ports i_valid]
set_drive 1  [get_ports {i_divisor[7]}]
set_drive 1  [get_ports {i_divisor[6]}]
set_drive 1  [get_ports {i_divisor[5]}]
set_drive 1  [get_ports {i_divisor[4]}]
set_drive 1  [get_ports {i_divisor[3]}]
set_drive 1  [get_ports {i_divisor[2]}]
set_drive 1  [get_ports {i_divisor[1]}]
set_drive 1  [get_ports {i_divisor[0]}]
