###################################################################

# Created by write_sdc on Fri May 26 08:54:09 2023

###################################################################
set sdc_version 2.1

set_units -time ns -resistance kOhm -capacitance pF -voltage V -current mA
set_operating_conditions -max WCCOM -max_library                               \
fsa0m_a_generic_core_ss1p62v125c\
                         -min BCCOM -min_library                               \
fsa0m_a_generic_core_ff1p98vm40c
set_max_fanout 10 [current_design]
set_max_area 0
set_load -pin_load 10 [get_ports out_valid]
set_load -pin_load 10 [get_ports {data_o[7]}]
set_load -pin_load 10 [get_ports {data_o[6]}]
set_load -pin_load 10 [get_ports {data_o[5]}]
set_load -pin_load 10 [get_ports {data_o[4]}]
set_load -pin_load 10 [get_ports {data_o[3]}]
set_load -pin_load 10 [get_ports {data_o[2]}]
set_load -pin_load 10 [get_ports {data_o[1]}]
set_load -pin_load 10 [get_ports {data_o[0]}]
create_clock [get_ports clk]  -period 18  -waveform {0 9}
set_clock_latency 0.5  [get_clocks clk]
set_clock_uncertainty 0.1  [get_clocks clk]
set_input_delay -clock clk  -max 1  [get_ports clk]
set_input_delay -clock clk  -max 1  [get_ports reset]
set_input_delay -clock clk  -max 1  [get_ports in_en]
set_input_delay -clock clk  -max 1  [get_ports mode]
set_input_delay -clock clk  -max 1  [get_ports {data_i[15]}]
set_input_delay -clock clk  -max 1  [get_ports {data_i[14]}]
set_input_delay -clock clk  -max 1  [get_ports {data_i[13]}]
set_input_delay -clock clk  -max 1  [get_ports {data_i[12]}]
set_input_delay -clock clk  -max 1  [get_ports {data_i[11]}]
set_input_delay -clock clk  -max 1  [get_ports {data_i[10]}]
set_input_delay -clock clk  -max 1  [get_ports {data_i[9]}]
set_input_delay -clock clk  -max 1  [get_ports {data_i[8]}]
set_input_delay -clock clk  -max 1  [get_ports {data_i[7]}]
set_input_delay -clock clk  -max 1  [get_ports {data_i[6]}]
set_input_delay -clock clk  -max 1  [get_ports {data_i[5]}]
set_input_delay -clock clk  -max 1  [get_ports {data_i[4]}]
set_input_delay -clock clk  -max 1  [get_ports {data_i[3]}]
set_input_delay -clock clk  -max 1  [get_ports {data_i[2]}]
set_input_delay -clock clk  -max 1  [get_ports {data_i[1]}]
set_input_delay -clock clk  -max 1  [get_ports {data_i[0]}]
set_output_delay -clock clk  -min 0.5  [get_ports out_valid]
set_output_delay -clock clk  -min 0.5  [get_ports {data_o[7]}]
set_output_delay -clock clk  -min 0.5  [get_ports {data_o[6]}]
set_output_delay -clock clk  -min 0.5  [get_ports {data_o[5]}]
set_output_delay -clock clk  -min 0.5  [get_ports {data_o[4]}]
set_output_delay -clock clk  -min 0.5  [get_ports {data_o[3]}]
set_output_delay -clock clk  -min 0.5  [get_ports {data_o[2]}]
set_output_delay -clock clk  -min 0.5  [get_ports {data_o[1]}]
set_output_delay -clock clk  -min 0.5  [get_ports {data_o[0]}]
set_drive 1  [get_ports clk]
set_drive 1  [get_ports reset]
set_drive 1  [get_ports in_en]
set_drive 1  [get_ports mode]
set_drive 1  [get_ports {data_i[15]}]
set_drive 1  [get_ports {data_i[14]}]
set_drive 1  [get_ports {data_i[13]}]
set_drive 1  [get_ports {data_i[12]}]
set_drive 1  [get_ports {data_i[11]}]
set_drive 1  [get_ports {data_i[10]}]
set_drive 1  [get_ports {data_i[9]}]
set_drive 1  [get_ports {data_i[8]}]
set_drive 1  [get_ports {data_i[7]}]
set_drive 1  [get_ports {data_i[6]}]
set_drive 1  [get_ports {data_i[5]}]
set_drive 1  [get_ports {data_i[4]}]
set_drive 1  [get_ports {data_i[3]}]
set_drive 1  [get_ports {data_i[2]}]
set_drive 1  [get_ports {data_i[1]}]
set_drive 1  [get_ports {data_i[0]}]
